Revit 2026 API

# ExternalEvent Properties

---

The ExternalEvent type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsPending | Checking whether an event has been raised but not yet executed. |

#### Reference

ExternalEvent Class

Autodesk.Revit.UI Namespace